# Pandas Tutorial

### A great library for working with data

## Author: Samyakh Tukra

#### Before getting into the code understand what data types look like:
Pandas is actually built on top of numpy... it is essentially numpy but with labels! Pandas supports managing data in tabular form and there are 2 types of tabular data:
1. DataFrame:these are like excel spreadsheets. The rows and columns can be considered as series data made up of different objects (i.e. labels). These series are indexed. It is a 2 dimensional array! = spreadsheet.

2. Series: these are like one dimensional numpy arrays but with an index i.e. a label.

### First I will teach how to create these dataypes in Pandas then I'll go onto doing actual data analysis

In [1]:
import numpy as np
import pandas as pd
# you have to specify what you want to import from pandas as it is a big library
from pandas import Series, DataFrame

In [6]:
# To create a series data: use the function: pd.Series:
my_series = pd.Series(np.arange(8), index=['row 1', 'row 2','row 3','row 4','row 5', 'row 6', 'row 7', 'row 8'])
my_series

row 1    0
row 2    1
row 3    2
row 4    3
row 5    4
row 6    5
row 7    6
row 8    7
dtype: int32

In [8]:
"""above I am using the numpy array to create an array of values but I am also 
indexing them i.e. giving each row a name! if I don't specify an index, Pandas
will automatically index it as integer values i.e. 0,1,2....n"""

# Additionally I can also give it a name:
x= pd.Series(np.arange(3),index=['1x','2x','3x'],name='newseries')
x

1x    0
2x    1
3x    2
Name: newseries, dtype: int32

In [9]:
# to get values of the series:
x.values # will simply output the integer values (not the index!)

array([0, 1, 2])

In [10]:
x.index # outputs the index names:

Index(['1x', '2x', '3x'], dtype='object')

In [11]:
# using numpy: np.nan function we can also have not-a-number values:
y=pd.Series(np.array([1,2,np.nan,3,np.nan]),name='nan-series')
y

0    1.0
1    2.0
2    NaN
3    3.0
4    NaN
Name: nan-series, dtype: float64

In [12]:
# as seen above, I have some NaN values and since, I didn't specify an index Pandas
#automatically gave it one!

In [14]:
# To extract data from series:
# extract by specifying index:
my_series['row 7'] # remember in python indexing is always done with square brackets

6

In [15]:
# or by integer indexing:
my_series[7]# 8th row!

7

In [18]:
my_series[[1,7]] # will return 2 values, row 1 (i.e. second row) and the 8th row (7)

row 2    1
row 8    7
dtype: int32

In [19]:
my_series[3:6] # as well as standard slicing

row 4    3
row 5    4
row 6    5
dtype: int32

In [20]:
# we can also slice from indexes:
my_series['row 1':'row 5']

row 1    0
row 2    1
row 3    2
row 4    3
row 5    4
dtype: int32

the index input argument in pd.Series always labels rows.... now let's create dataframes:
## DataFrames:
this will essentially carry labels for rows aswell as columns (literally like an
excel spreadsheet)

In [3]:
DF_obj = DataFrame(np.random.rand(36).reshape((6,6)), 
                   index=['row 1', 'row 2', 'row 3', 'row 4', 'row 5', 'row 6'],
                   columns=['column 1', 'column 2', 'column 3', 'column 4', 'column 5', 'column 6'])
DF_obj

       column 1  column 2  column 3  column 4  column 5  column 6
row 1  0.617198  0.333289  0.309594  0.110135  0.170359  0.494338
row 2  0.123996  0.281097  0.923735  0.626989  0.556672  0.172247
row 3  0.836940  0.203892  0.439892  0.454288  0.147774  0.726046
row 4  0.729429  0.264917  0.966528  0.218281  0.765516  0.788777
row 5  0.732542  0.223860  0.738969  0.292683  0.754843  0.718043
row 6  0.191924  0.256586  0.341628  0.486079  0.081642  0.372080

In [8]:
# I can also create a time series based dataframes using the pandas date_range function
my_dates_index= pd.date_range('20180108',periods=8) 
# the above is 2018-01-08 and we want it to extend to 8 days:
print(my_dates_index)

# now lets create our data:
data= np.random.rand(48).reshape(8,6)
data

DatetimeIndex(['2018-01-08', '2018-01-09', '2018-01-10', '2018-01-11',
               '2018-01-12', '2018-01-13', '2018-01-14', '2018-01-15'],
              dtype='datetime64[ns]', freq='D')

array([[0.4171354 , 0.24258937, 0.96627395, 0.66312738, 0.05121845,
        0.12344391],
       [0.86625085, 0.95088134, 0.1475108 , 0.05101476, 0.84931148,
        0.88438299],
       [0.64985082, 0.95423567, 0.3155321 , 0.44502109, 0.29145337,
        0.53854921],
       [0.95040406, 0.07032633, 0.54936952, 0.51481822, 0.50488032,
        0.05632216],
       [0.92760481, 0.05588356, 0.69258713, 0.75256248, 0.22034916,
        0.24421017],
       [0.81508061, 0.00681376, 0.84958601, 0.47195348, 0.59814748,
        0.94667976],
       [0.95832764, 0.58641475, 0.24259932, 0.48895132, 0.47913975,
        0.57730081],
       [0.66554557, 0.46756702, 0.21363159, 0.48564842, 0.71541169,
        0.6838695 ]])

In [9]:
new_frame= pd.DataFrame(data,index=my_dates_index, columns=list('ABCDEF'))
new_frame

                   A         B         C         D         E         F
2018-01-08  0.417135  0.242589  0.966274  0.663127  0.051218  0.123444
2018-01-09  0.866251  0.950881  0.147511  0.051015  0.849311  0.884383
2018-01-10  0.649851  0.954236  0.315532  0.445021  0.291453  0.538549
2018-01-11  0.950404  0.070326  0.549370  0.514818  0.504880  0.056322
2018-01-12  0.927605  0.055884  0.692587  0.752562  0.220349  0.244210
2018-01-13  0.815081  0.006814  0.849586  0.471953  0.598147  0.946680
2018-01-14  0.958328  0.586415  0.242599  0.488951  0.479140  0.577301
2018-01-15  0.665546  0.467567  0.213632  0.485648  0.715412  0.683869

In [10]:
# indexing is simple we have to call the .ix[] function:

DF_obj.ix[['row 2','row 5'],['column 5','column 2']] # calling 2 rows and columns

       column 5  column 2
row 2  0.556672  0.281097
row 5  0.754843  0.223860

In [13]:
# we can also use comparison operators with scalar values to get boolean results
DF_obj <.2 # whether a value is less than .2
# we can also perform this on a specific column as opposed to the whole dataset

       column 1  column 2  column 3  column 4  column 5  column 6
row 1     False     False     False      True      True     False
row 2      True     False     False     False     False      True
row 3     False     False     False     False      True     False
row 4     False     False     False     False     False     False
row 5     False     False     False     False     False     False
row 6      True     False     False     False      True     False

In [14]:
# if we wanted the value of those variables that satisfy the condition:

In [15]:
DF_obj[DF_obj<.2]

       column 1  column 2  column 3  column 4  column 5  column 6
row 1       NaN       NaN       NaN  0.110135  0.170359       NaN
row 2  0.123996       NaN       NaN       NaN       NaN  0.172247
row 3       NaN       NaN       NaN       NaN  0.147774       NaN
row 4       NaN       NaN       NaN       NaN       NaN       NaN
row 5       NaN       NaN       NaN       NaN       NaN       NaN
row 6  0.191924       NaN       NaN       NaN  0.081642       NaN

If you had large data and you wanted to see a snippet of that data (not all of it) then you use the .head() function which will by defsault display the first 5 rows... or you can say .head(7) where you specify to python that you want to see the first 7 rows. Additionally you can do the same from bottom up by using .tail() where you will see the bottom 5 rows...

In [16]:
DF_obj.head()

       column 1  column 2  column 3  column 4  column 5  column 6
row 1  0.617198  0.333289  0.309594  0.110135  0.170359  0.494338
row 2  0.123996  0.281097  0.923735  0.626989  0.556672  0.172247
row 3  0.836940  0.203892  0.439892  0.454288  0.147774  0.726046
row 4  0.729429  0.264917  0.966528  0.218281  0.765516  0.788777
row 5  0.732542  0.223860  0.738969  0.292683  0.754843  0.718043

In [18]:
DF_obj.tail(2)

       column 1  column 2  column 3  column 4  column 5  column 6
row 5  0.732542  0.223860  0.738969  0.292683  0.754843  0.718043
row 6  0.191924  0.256586  0.341628  0.486079  0.081642  0.372080

In [20]:
# If I wanted to extract only values from the data set use the .values function
DF_obj.values # this will yield the underlying numpy array of values

array([[0.61719782, 0.33328947, 0.30959437, 0.11013523, 0.17035878,
        0.49433781],
       [0.12399566, 0.2810971 , 0.92373495, 0.62698899, 0.55667154,
        0.17224719],
       [0.83693982, 0.20389199, 0.43989223, 0.45428815, 0.14777394,
        0.72604581],
       [0.72942922, 0.26491739, 0.96652823, 0.21828089, 0.7655163 ,
        0.78877715],
       [0.73254173, 0.22386029, 0.73896885, 0.29268271, 0.75484323,
        0.71804314],
       [0.19192357, 0.2565864 , 0.34162826, 0.48607942, 0.08164209,
        0.37207972]])

In [22]:
DF_obj.index# similarly to get the index/rows

Index(['row 1', 'row 2', 'row 3', 'row 4', 'row 5', 'row 6'], dtype='object')

In [23]:
DF_obj.columns # similarly get the rows.

Index(['column 1', 'column 2', 'column 3', 'column 4', 'column 5', 'column 6'], dtype='object')

In [24]:
# you can also transpose the rows and columns using the .T attribute:
DF_obj.T# so columns are now rows!

             row 1     row 2     row 3     row 4     row 5     row 6
column 1  0.617198  0.123996  0.836940  0.729429  0.732542  0.191924
column 2  0.333289  0.281097  0.203892  0.264917  0.223860  0.256586
column 3  0.309594  0.923735  0.439892  0.966528  0.738969  0.341628
column 4  0.110135  0.626989  0.454288  0.218281  0.292683  0.486079
column 5  0.170359  0.556672  0.147774  0.765516  0.754843  0.081642
column 6  0.494338  0.172247  0.726046  0.788777  0.718043  0.372080

In [25]:
new_frame.T

,2018-01-08 00:00:00,2018-01-09 00:00:00,2018-01-10 00:00:00,2018-01-11 00:00:00,2018-01-12 00:00:00,2018-01-13 00:00:00,2018-01-14 00:00:00,2018-01-15 00:00:00
A,0.417135,0.866251,0.649851,0.950404,0.927605,0.815081,0.958328,0.665546
B,0.242589,0.950881,0.954236,0.070326,0.055884,0.006814,0.586415,0.467567
C,0.966274,0.147511,0.315532,0.549370,0.692587,0.849586,0.242599,0.213632
D,0.663127,0.051015,0.445021,0.514818,0.752562,0.471953,0.488951,0.485648
E,0.051218,0.849311,0.291453,0.504880,0.220349,0.598147,0.479140,0.715412
F,0.123444,0.884383,0.538549,0.056322,0.244210,0.946680,0.577301,0.683869

In [31]:
# we can also sort the dataframe by index, values and columns:
new_frame.sort_index(axis=1, ascending=False) # axis = 0 for rows, 1= columns

                   F         E         D         C         B         A
2018-01-08  0.123444  0.051218  0.663127  0.966274  0.242589  0.417135
2018-01-09  0.884383  0.849311  0.051015  0.147511  0.950881  0.866251
2018-01-10  0.538549  0.291453  0.445021  0.315532  0.954236  0.649851
2018-01-11  0.056322  0.504880  0.514818  0.549370  0.070326  0.950404
2018-01-12  0.244210  0.220349  0.752562  0.692587  0.055884  0.927605
2018-01-13  0.946680  0.598147  0.471953  0.849586  0.006814  0.815081
2018-01-14  0.577301  0.479140  0.488951  0.242599  0.586415  0.958328
2018-01-15  0.683869  0.715412  0.485648  0.213632  0.467567  0.665546

In [32]:
new_frame.sort_values(by='B', ascending= True) # the by parameter states that I want
# to sort the data by the column 'b' in ascending order

                   A         B         C         D         E         F
2018-01-13  0.815081  0.006814  0.849586  0.471953  0.598147  0.946680
2018-01-12  0.927605  0.055884  0.692587  0.752562  0.220349  0.244210
2018-01-11  0.950404  0.070326  0.549370  0.514818  0.504880  0.056322
2018-01-08  0.417135  0.242589  0.966274  0.663127  0.051218  0.123444
2018-01-15  0.665546  0.467567  0.213632  0.485648  0.715412  0.683869
2018-01-14  0.958328  0.586415  0.242599  0.488951  0.479140  0.577301
2018-01-09  0.866251  0.950881  0.147511  0.051015  0.849311  0.884383
2018-01-10  0.649851  0.954236  0.315532  0.445021  0.291453  0.538549

In [33]:
new_frame[1:4] # information is from the first index up to, but not including the last index

                   A         B         C         D         E         F
2018-01-09  0.866251  0.950881  0.147511  0.051015  0.849311  0.884383
2018-01-10  0.649851  0.954236  0.315532  0.445021  0.291453  0.538549
2018-01-11  0.950404  0.070326  0.549370  0.514818  0.504880  0.056322

In [35]:
# say I want all rows but some columns use the .loc function (this is for index based location selection)
new_frame.loc[:,['A','B']] # : means all

                   A         B
2018-01-08  0.417135  0.242589
2018-01-09  0.866251  0.950881
2018-01-10  0.649851  0.954236
2018-01-11  0.950404  0.070326
2018-01-12  0.927605  0.055884
2018-01-13  0.815081  0.006814
2018-01-14  0.958328  0.586415
2018-01-15  0.665546  0.467567

In [38]:
new_frame.iloc[1:3,2:4] # iloc function is used for index based location selection

                   C         D
2018-01-09  0.147511  0.051015
2018-01-10  0.315532  0.445021

## In the following Let's learn to append new data onto a dataframe

In [3]:
# first create a new dataframe:
startingdate='20190108'
sample_data= np.array(np.arange(24)).reshape(6,4)
dates_index=pd.date_range(startingdate,periods=6)
sample_df= pd.DataFrame(sample_data,index=dates_index,columns=list('ABCD'))
sample_df

             A   B   C   D
2019-01-08   0   1   2   3
2019-01-09   4   5   6   7
2019-01-10   8   9  10  11
2019-01-11  12  13  14  15
2019-01-12  16  17  18  19
2019-01-13  20  21  22  23

In [5]:
# creating a new data:
sample_df_2= sample_df.copy() # copy the original
sample_df_2['fruits']=['apple','banana','orange','strawberry','blueberry','pineapple']
sample_df_2

             A   B   C   D      fruits
2019-01-08   0   1   2   3       apple
2019-01-09   4   5   6   7      banana
2019-01-10   8   9  10  11      orange
2019-01-11  12  13  14  15  strawberry
2019-01-12  16  17  18  19   blueberry
2019-01-13  20  21  22  23   pineapple

In [8]:
# new series data: 
pd.Series([1,2,3,4,5,6], index=pd.date_range(startingdate,periods=6))

2019-01-08    1
2019-01-09    2
2019-01-10    3
2019-01-11    4
2019-01-12    5
2019-01-13    6
Freq: D, dtype: int64

In [9]:
# to append do as done in In[5] .....
sample_df_2['Extra data']= pd.Series([1,2,3,4,5,6], index=pd.date_range(startingdate,periods=6))
sample_df_2

             A   B   C   D      fruits  Extra data
2019-01-08   0   1   2   3       apple           1
2019-01-09   4   5   6   7      banana           2
2019-01-10   8   9  10  11      orange           3
2019-01-11  12  13  14  15  strawberry           4
2019-01-12  16  17  18  19   blueberry           5
2019-01-13  20  21  22  23   pineapple           6

In [16]:
new_ans=sample_df_2.loc[:,['Extra data']]*3 +1

In [23]:
sample_df_2.loc[:,['Extra data']]=new_ans

# also change the data
sample_df_2.iloc[3,4]='pear' # iat is for date time index selection via integer/iloc would work too
sample_df_2

             A   B   C   D     fruits  Extra data
2019-01-08   0   1   2   3      apple           4
2019-01-09   4   5   6   7     banana           7
2019-01-10   8   9  10  11     orange          10
2019-01-11  12  13  14  15       pear          13
2019-01-12  16  17  18  19  blueberry          16
2019-01-13  20  21  22  23  pineapple          19

In [31]:
len(sample_df_2) # the number of rows
sample_df_2.shape # rows,cols
sample_df_2.shape[0]#will give you the rows
print('these are the no of columns: {}'.format(sample_df_2.shape[1]))
print('these are the no of rows: {}'.format(sample_df_2.shape[0]))

these are the no of columns: 6
these are the no of rows: 6

In [32]:
# to get info:
sample_df_2.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 6 entries, 2019-01-08 to 2019-01-13
Freq: D
Data columns (total 6 columns):
A             6 non-null int32
B             6 non-null int32
C             6 non-null int32
D             6 non-null int32
fruits        6 non-null object
Extra data    6 non-null int64
dtypes: int32(4), int64(1), object(1)
memory usage: 400.0+ bytes

In [ ]:
# to read csv files:
pd.read_csv(skiprows=4)# if you don't want to read the first 4 rows in your frame... use skiprows function
pd.read_excel()
pd.read_json()